Revit 2024 API
ColorOptions.SelectionColor Property
 The color of the current canvas theme used to highlight selected elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public Color SelectionColor { get; set; }
Visual Basic
Public Property SelectionColor As Color
	Get
	Set
Visual C++
public:
property Color^ SelectionColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ColorOptions Class
Autodesk.Revit.DB Namespace